"""Общая численность населения"""
russia_total_pop = {
    2014: 146090613,
    2015: 146405999,
    2016: 146674541,
    2017: 146842401,
    2018: 146830575,
    2019: 146764655,
    2020: 146459803,
}


"""Процент городского населения"""
russia_city_res = {
    2014: 74,
    2015: 74.09,
    2016: 74.3,
    2017: 74.4,
    2018: 74.59,
    2019: 74.7,
    2020: 74.74,
}

"""Количественные изменения населения"""
russia_pop_chng = {
    2014: 305469,
    2015: 277422,
    2016: 259662,
    2017: 76060,
    2018: -99712,
    2019: -32130,
    2020: -577575
}

"""Миграционные изменения (курская область, т.к на сайте росстата нет данных по России в целом)"""
kursk_migr_chng = {
    2011: -1509,
    2012: -1700,
    2013: -590,
    2014: -1087,
    2015: -2501,
    2016: -1929,
    2017: -3058,
    2018: -3156,
    2019: -3011,
    2020: -3455
}
"""Кол.во населения до, трудо и выше трудоспособного возраста. Тысяч человек"""
russia_labour_pop_2020 = {
    'below_lab': 27387.1,
    'lab': 81881.1,
    'above_lab':36902.8
}

"""Соотношение полов. Тыс.человек"""
russia_men_female_2020 = {
    'men': 67847.8,
    'female': 78323.2
}

"""Число мужчин определенного возраста"""
russia_men_by_age = {
    '0-4': 4155269,
    '5-9': 4907942,
    '10-14': 4231202,
    '15-19': 3712332,
    '20-24': 3446216,
    '25-29': 4400971,
    '30-34': 6272098,
    '35-39': 6016923,
    '40-44': 5296140,
    '45-49': 4752383,
    '50-54': 4163442,
    '55-59': 4413105,
    '60-64': 4347045,
    '65-69': 3253289,
    '70-74': 2199286,
    '75-79': 820804,
    '80+': 1459352,

}

"""Число женщин определенного возраста"""
russia_women_by_age = {
    '0-4': 3924292,
    '5-9': 4643555,
    '10-14': 4025452,
    '15-19': 3559667,
    '20-24': 3329784,
    '25-29': 4181285,
    '30-34': 6151363,
    '35-39': 6113885,
    '40-44': 5619054,
    '45-49': 5227528,
    '50-54': 4729046,
    '55-59': 5443305,
    '60-64': 5953372,
    '65-69': 5215570,
    '70-74': 4028393,
    '75-79': 1877315,
    '80+': 4300350,
}

"""Кол.во рожденных"""
russia_born = {
    2018: 1604.6*1000,
    2019: 1484.5*1000
}

"""Число смертей"""
russia_died = {
    2018: 1827.8*1000,
    2019: 1800.7*1000
}


