"""Общая численность населения"""
belgorod_total_pop = {
    2014: 1546022,
    2015: 1549037,
    2016: 1551500,
    2017: 1551370,
    2018: 1548647,
    2019: 1548284,
    2020: 1545205,
}


"""Процент городского населения"""
belgorod_city_res = {
    2014: 66.9,
    2015: 67.09,
    2016: 67.3,
    2017: 67.4,
    2018: 67.5,
    2019: 67.5,
    2020: 67.56,
}

"""Количественные изменения населения"""
belgorod_pop_chng = {
    2014: 3828,
    2015: 2201,
    2016: 2728,
    2017: -2989,
    2018: -2458,
    2019: 1733,
    2020: -7892
}

"""Миграционные изменения"""
belgorod_migr_chng = {
    2011: 4662,
    2012: 4059,
    2013: 3024,
    2014: 586,
    2015: -1514,
    2016: -171,
    2017: -832,
    2018: 237,
    2019: 263,
    2020: 551
}
"""Кол.во населения до, трудо и выше трудоспособного возраста. Тысяч человек"""
belgorod_labour_pop_2020 = {
    'below_lab': 260.1,
    'lab': 857.4,
    'above_lab':423.8
}

"""Соотношение полов"""
belgorod_men_female_2020 = {
    'men': 712.7,
    'female': 828.6
}

"""Число мужчин определенного возраста"""
belgorod_men_by_age = {
    '0-4': 37333,
    '5-9': 46509,
    '10-14': 42716,
    '15-19': 35886,
    '20-24': 33736,
    '25-29': 46473,
    '30-34': 64540,
    '35-39': 62844,
    '40-44': 55493,
    '45-49': 50146,
    '50-54': 44755,
    '55-59': 50487,
    '60-64': 51158,
    '65-69': 38701,
    '70-74': 26091,
    '75-79': 9377,
    '80+': 16486,

}

"""Число женщин определенного возраста"""
belgorod_women_by_age = {
    '0-4': 34971,
    '5-9': 43708,
    '10-14': 40436,
    '15-19': 35006,
    '20-24': 33657,
    '25-29': 45437,
    '30-34': 64024,
    '35-39': 62568,
    '40-44': 57560,
    '45-49': 55446,
    '50-54': 51280,
    '55-59': 62377,
    '60-64': 68380,
    '65-69': 58200,
    '70-74': 44732,
    '75-79': 21614,
    '80+': 49132,
}

"""Кол.во рожденных"""
belgorod_born = {
    2018: 14317,
    2019: 13183
}

"""Число смертей"""
belgorod_died = {
    2018: 20898,
    2019: 20662
}


